using System.Reflection.Metadata;
using System.Text;

namespace ClassWork13
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //კონსოლში მომხმარებელმა უნდა ემოიყვანოს ელ.ფოსტა, სახელი და პაროლი.
            //ეს ყველაფერი უნდა ჩაიწეროს users - ფაილში.
            //ელ.ფოსტა უნდა იყოს უნიკალური ანუ ერთიდა იმავე ელ.ფოსტა არ უნდ
            //იყოს გამოყენებული რაც გულისხმობს იმას: თუ ვინემ ცდის უკვე არსებული
            //ელ.ფოსტით შემოსვლას უნდა აჩვენოს რომ ეს ელ.ფოსტა უკვე
            //გამოყენებულია.
            //დამატებით ჩვენ უნდა შეგვეძლოს ამ ინფომრაციის ნახვა, ანუ კონსოლში უნდა
            //ვნახულობდე რა წერია users.txt - ში.კონსოლში მომხმარებელმა უნდა ემოიყვანოს ელ.ფოსტა, სახელი და პაროლი.
            //ეს ყველაფერი უნდა ჩაიწეროს users - ფაილში.
            //ელ.ფოსტა უნდა იყოს უნიკალური ანუ ერთიდა იმავე ელ.ფოსტა არ უნდ
            //იყოს გამოყენებული რაც გულისხმობს იმას: თუ ვინემ ცდის უკვე არსებული
            //ელ.ფოსტით შემოსვლას უნდა აჩვენოს რომ ეს ელ.ფოსტა უკვე
            //გამოყენებულია.
            //დამატებით ჩვენ უნდა შეგვეძლოს ამ ინფომრაციის ნახვა, ანუ კონსოლში უნდა
            //ვნახულობდე რა წერია users.txt - ში.

        }

    }
}
