namespace HomeWork9
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //• შექმენით სტუდენტის კლასი,რომელსაც უნდა ჰქონდეს
            //სახელი
            //გვარი
            //ასაკი(მინიმაური უნდა იყოს 18 წელი  მაქსიმალური 50 წელი)
            //ქულა(მინიმალური უნდა იყოს 0 მაქსიმალური 100)



            //• წინა გაკვეთილში მოაცემული კლასები გადააწყეთ property-ებად(ანუ გააკეთეთ ის რაც აგიხსენით გაკვეთილზე).
            //აგრეთვე Account კლასს დაუმატეთ ფუნქციონალი სადაც მომხმარებელი შეძლებს რომ ანგარიში გაანაღოს ან შეავსოს მისთვის სასურველი თანხით.


        }
    }
}
