namespace HomeWork23
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //დავალება 2 - შოპის სისიტემა

            //1.შექმენით მარტივი რეგისტრაცია სახელით და ელ.ფოსტით.
            //2.შექმენით პროდუცტების ლისტი და გააკეთეთ ყიდვის ფუნქცინოალი.
            //3.ყიდვის დროს უნდა შეიქმნას ფაილი რომელიც იქნება მომხმარებლის სახელით
            //   მაგალითად: gio.txt, ani.txt და ასე შემდეგ.
            //4.ფაილში უნდა ეწეროს იმ პროდუქტების ინფორმაცია რაც ამ ადამიანმა
            //   შეიძინა.
            //5  სურვილის შემთხვევაში(თუ მოასწრებთ) ააწყეთ მენუს სისტემა,
            //   სადაც იქნება როგორც რეგისტრაცია ასევე გასვლა და ახალი მომხმარებლით
            //   რეგისტრაციის გავლა რათა კონსოლის გამორთვის გარეშე შეძლოს სხვადასხვა
            //   მომხმარებლის დარეგისტრირება და პროდუქტების შეძენა.
        }
    }
}
