using static System.Net.Mime.MediaTypeNames;
using static System.Runtime.InteropServices.JavaScript.JSType;

namespace HomeWork22
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //დავალება 1 - მომხმარებლის რეგისტრაციის სისტემა.

            //1.კონსოლში მომხმარებელმა უნდა ემოიყვანოს ელ.ფოსტა, სახელი და პაროლი.
            //2.ეს ყველაფერი უნდა ჩაიწეროს users-ფაილში.
            //3.ელ.ფოსტა უნდა იყოს უნიკალური ანუ ერთიდა იმავე ელ.ფოსტა არ უნდ
            //   იყოს გამოყენებული რაც გულისხმობს იმას: თუ ვინემ ცდის უკვე არსებული
            //   ელ.ფოსტით შემოსვლას უნდა აჩვენოს რომ ეს ელ.ფოსტა უკვე
            //   გამოყენებულია.
            //4.დამატებით ჩვენ უნდა შეგვეძლოს ამ ინფომრაციის ნახვა, ანუ კონსოლში უნდა
            //   ვნახულობდე რა წერია users.txt - ში.


            //დავალება 2 - შოპის სისიტემა

            //1.შექმენით მარტივი რეგისტრაცია სახელით და ელ.ფოსტით.
            //2.შექმენით პროდუცტების ლისტი და გააკეთეთ ყიდვის ფუნქცინოალი.
            //3.ყიდვის დროს უნდა შეიქმნას ფაილი რომელიც იქნება მომხმარებლის სახელით
            //   მაგალითად: gio.txt, ani.txt და ასე შემდეგ.
            //4.ფაილში უნდა ეწეროს იმ პროდუქტების ინფორმაცია რაც ამ ადამიანმა
            //   შეიძინა.
            //5  სურვილის შემთხვევაში(თუ მოასწრებთ) ააწყეთ მენუს სისტემა,
            //   სადაც იქნება როგორც რეგისტრაცია ასევე გასვლა და ახალი მომხმარებლით
            //   რეგისტრაციის გავლა რათა კონსოლის გამორთვის გარეშე შეძლოს სხვადასხვა
            //   მომხმარებლის დარეგისტრირება და პროდუქტების შეძენა.
        }
    }
}
